// 3개의 정수를 받아서 3개 모두 빼주는 함수


// 홍길동을 n번 출력해주는 함수



// 1~n까지 홀수만 출력해주는 함수



// 문자열을 입력받고 원하는 문자의 개수를 구해주는 함수

// 문자열을 받는다 (매개변수)
// 문자도 받는다 (매개변수)
// 함수 정의한다
// 문자열의 길이 .length를 이용해서 반복문을 돌린다.
// 같으면 개수를 센다
// charAt()을 사용한다.
// 문자랑 비교한다
// 값을 리턴한다.





// 한글을 정수로 바꿔주는 함수 (일공이사 -> 1024)

// 받는 값 hangle
// 사용자가 hangle을 입력하면 hangles에서 반복을 돌리면서 index를 찾으면 된다.
// 사용자가 입력한 hangle의 길이만큼 반복 돌기
// hangles indexof로 hangle의 글자가 어디에 있는지 찾기
// 하나의 변수에 네 개를 담아야하니까 누적합을 시킨다. , 
// 옆으로 연결시키기위해 변수를 빈문자열로 선언한다. (let result = "";)



// 정수를 한글로 바꿔주는 함수 (1024 -> 일공이사)

// 사용자가 입력한 num의 갯수만큼 반복을 돈다.
// num에서 charAt으로 i를 가져오면 순서대로 들어오고, 
// 이 값을 str에서 다시 chatAt으로 넘겨준다. str.charAt
// 그리고 이 값을 다시 result로 누적합시킨다.


  
  
  
  

  
  
  
  
  
  
  
  
  
  
  
  
  