// 입력받은 3개 중 홀수만 모두 더해주는 함수

// 알고리즘
// 3개 입력받기
// 입력 받은 값이 홀수인지 짝수인지 확인하기
// 홀수면 누적합시키기 (누적복합연산자)
// 홀수로 나눴을 때 맞으면 누적합, 아니면 아무것도 하지 않는다.



// 입력받은 수까지 반복 후 짝수의 합을 모두 더해주는 함수

// 알고리즘
// 숫자 하나 입력받기
// 입력 받은 수 까지 반복 돌리기 (for문)
// 입력 받은 수 중 짝수만 누적합시키기



// 입력한 값 중 a를 제거해주는 함수
// ex) "가a나a다a라a마a바" -> "가나다라마바"

// 알고리즘
// 값을 받는다.(문자열과 지울 문자a)
// 값중에 a라는 문자열이 있는지 찾는다. (for문)
// a를 제외하고 반환한다. (if문)
// 입력한 문자열의 길이만큼 반복문을 돈다.
// 만약 문자 중 "a"랑 같은 게 있다면 다음 반복으로 넘어가고
// 공백 문자열과 문자를 누적합시킨다



// 입력한 값이 실수인지 정수인지 알려주는 함수

// 알고리즘
// 숫자를 입력받고
// 입력 받은 숫자를 진짜 숫자로 바꾼다. (Number)
// 입력 받은 수를 정수로 바꿔서 (parseInt())
// 실수면 "실수", 정수면 "정수", 숫자가 아니면 "숫자가 아닙니다." (if문)
// 타입으로 먼저 비교를 했기때문에
//     //  문자열인지 아닌지를 먼저 비교해주어야한다.
// 숫자가 정수와 같으면 정수 // 숫자가 정수와 같지 않다면 실수



// 입력받은 문자를 뒤집어주는 함수
// ex) "abcdefg" -> "gfedcba";

// 사용자가 입력할 문자의 총 길이
// 총 길이의 마지막 문자를 가져오려면 -1
 // length는 길이를 세기 떄문에 1부터 시작, i는 방 번호이기때문에 0부터 시작
  // 따라서 1을 더 빼준다.


  
  
  
  
  
  
  
  
  
  
  
  
  